--- crates/pareto-rs/src/plugin.rs
+++ replace TimelinePlugin::len -> usize with 0
@@ -206,17 +206,17 @@
         self.events
             .lock()
             .unwrap()
             .iter()
             .map(|e| e.input_tokens + e.output_tokens)
             .sum()
     }
     pub fn len(&self) -> usize {
-        self.events.lock().unwrap().len()
+        0 /* ~ changed by cargo-mutants ~ */
     }
     pub fn is_empty(&self) -> bool {
         self.events.lock().unwrap().is_empty()
     }
 }
 
 impl Default for TimelinePlugin {
     fn default() -> Self {
